# Inverted3dShape Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..Inverted3dShape Property
BuiltInFailures..::..RebarFailures Class See Also
---
The Rebar Shape XX cannot be inverted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId Inverted3dShape { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Inverted3dShape As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ Inverted3dShape {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace